import { NewsItemProps } from "../components/News/NewsItem";

export enum AuthState {
    No  = "no",
    Yes = "yes"
}

export const getNews= (): NewsItemProps[] => {
    return [
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: `спасибо за внимание спасибо за внимание спасибо за внимание спасибо за внимание спасибо за внимание спасибо за внимание`
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: `спасибо за внимание спасибо за внимание спасибо за внимание спасибо за внимание спасибо за внимание спасибо за внимание`
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
        {
            header: "Внимание",
            from: "Директор какого-нибудь института",
            date: "Вторник 19:13:27",
            message: "спасибо за внимание"
        },
    ]
}